FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_usart.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAMV71_USART_COMPONENT_
#define _SAMV71_USART_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Universal Synchronous Asynchronous Receiver Transmitter */
/* ============================================================================= */
/** \addtogroup SAMV71_USART Universal Synchronous Asynchronous Receiver Transmitter */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief Usart hardware registers */
    typedef struct
    {
        __O uint32_t US_CR;        /**< \brief (Usart Offset: 0x0000) Control Register */
        __IO uint32_t US_MR;       /**< \brief (Usart Offset: 0x0004) Mode Register */
        __O uint32_t US_IER;       /**< \brief (Usart Offset: 0x0008) Interrupt Enable Register */
        __O uint32_t US_IDR;       /**< \brief (Usart Offset: 0x000C) Interrupt Disable Register */
        __I uint32_t US_IMR;       /**< \brief (Usart Offset: 0x0010) Interrupt Mask Register */
        __I uint32_t US_CSR;       /**< \brief (Usart Offset: 0x0014) Channel Status Register */
        __I uint32_t US_RHR;       /**< \brief (Usart Offset: 0x0018) Receive Holding Register */
        __O uint32_t US_THR;       /**< \brief (Usart Offset: 0x001C) Transmit Holding Register */
        __IO uint32_t US_BRGR;     /**< \brief (Usart Offset: 0x0020) Baud Rate Generator Register */
        __IO uint32_t US_RTOR;     /**< \brief (Usart Offset: 0x0024) Receiver Time-out Register */
        __IO uint32_t US_TTGR;     /**< \brief (Usart Offset: 0x0028) Transmitter Timeguard Register */
        __I uint32_t Reserved1[ 5 ];
        __IO uint32_t US_FIDI;     /**< \brief (Usart Offset: 0x0040) FI DI Ratio Register */
        __I uint32_t US_NER;       /**< \brief (Usart Offset: 0x0044) Number of Errors Register */
        __I uint32_t Reserved2[ 2 ];
        __IO uint32_t US_MAN;      /**< \brief (Usart Offset: 0x0050) Manchester Configuration Register */
        __IO uint32_t US_LINMR;    /**< \brief (Usart Offset: 0x0054) LIN Mode Register */
        __IO uint32_t US_LINIR;    /**< \brief (Usart Offset: 0x0058) LIN Identifier Register */
        __I uint32_t US_LINBRR;    /**< \brief (Usart Offset: 0x005C) LIN Baud Rate Register */
        __IO uint32_t US_LONMR;    /**< \brief (Usart Offset: 0x0060) LON Mode Register */
        __IO uint32_t US_LONPR;    /**< \brief (Usart Offset: 0x0064) LON Preamble Register */
        __IO uint32_t US_LONDL;    /**< \brief (Usart Offset: 0x0068) LON Data Length Register */
        __IO uint32_t US_LONL2HDR; /**< \brief (Usart Offset: 0x006C) LON L2HDR Register */
        __I uint32_t US_LONBL;     /**< \brief (Usart Offset: 0x0070) LON Backlog Register */
        __IO uint32_t US_LONB1TX;  /**< \brief (Usart Offset: 0x0074) LON Beta1 Tx Register */
        __IO uint32_t US_LONB1RX;  /**< \brief (Usart Offset: 0x0078) LON Beta1 Rx Register */
        __IO uint32_t US_LONPRIO;  /**< \brief (Usart Offset: 0x007C) LON Priority Register */
        __IO uint32_t US_IDTTX;    /**< \brief (Usart Offset: 0x0080) LON IDT Tx Register */
        __IO uint32_t US_IDTRX;    /**< \brief (Usart Offset: 0x0084) LON IDT Rx Register */
        __IO uint32_t US_ICDIFF;   /**< \brief (Usart Offset: 0x0088) IC DIFF Register */
        __I uint32_t Reserved3[ 22 ];
        __IO uint32_t US_WPMR;     /**< \brief (Usart Offset: 0x00E4) Write Protection Mode Register */
        __I uint32_t US_WPSR;      /**< \brief (Usart Offset: 0x00E8) Write Protection Status Register */
    } Usart;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- US_CR : (USART Offset: 0x0000) Control Register -------- */
#define US_CR_RSTRX                          ( 0x1u << 2 )  /**< \brief (US_CR) Reset Receiver */
#define US_CR_RSTTX                          ( 0x1u << 3 )  /**< \brief (US_CR) Reset Transmitter */
#define US_CR_RXEN                           ( 0x1u << 4 )  /**< \brief (US_CR) Receiver Enable */
#define US_CR_RXDIS                          ( 0x1u << 5 )  /**< \brief (US_CR) Receiver Disable */
#define US_CR_TXEN                           ( 0x1u << 6 )  /**< \brief (US_CR) Transmitter Enable */
#define US_CR_TXDIS                          ( 0x1u << 7 )  /**< \brief (US_CR) Transmitter Disable */
#define US_CR_RSTSTA                         ( 0x1u << 8 )  /**< \brief (US_CR) Reset Status Bits */
#define US_CR_STTBRK                         ( 0x1u << 9 )  /**< \brief (US_CR) Start Break */
#define US_CR_STPBRK                         ( 0x1u << 10 ) /**< \brief (US_CR) Stop Break */
#define US_CR_STTTO                          ( 0x1u << 11 ) /**< \brief (US_CR) Clear TIMEOUT Flag and Start Time-out After Next Character Received */
#define US_CR_SENDA                          ( 0x1u << 12 ) /**< \brief (US_CR) Send Address */
#define US_CR_RSTIT                          ( 0x1u << 13 ) /**< \brief (US_CR) Reset Iterations */
#define US_CR_RSTNACK                        ( 0x1u << 14 ) /**< \brief (US_CR) Reset Non Acknowledge */
#define US_CR_RETTO                          ( 0x1u << 15 ) /**< \brief (US_CR) Start Time-out Immediately */
#define US_CR_RTSEN                          ( 0x1u << 18 ) /**< \brief (US_CR) Request to Send Pin Control */
#define US_CR_RTSDIS                         ( 0x1u << 19 ) /**< \brief (US_CR) Request to Send Pin Control */
#define US_CR_LINABT                         ( 0x1u << 20 ) /**< \brief (US_CR) Abort LIN Transmission */
#define US_CR_LINWKUP                        ( 0x1u << 21 ) /**< \brief (US_CR) Send LIN Wakeup Signal */
#define US_CR_FCS                            ( 0x1u << 18 ) /**< \brief (US_CR) Force SPI Chip Select */
#define US_CR_RCS                            ( 0x1u << 19 ) /**< \brief (US_CR) Release SPI Chip Select */
/* -------- US_MR : (USART Offset: 0x0004) Mode Register -------- */
#define US_MR_USART_MODE_Pos                 0
#define US_MR_USART_MODE_Msk                 ( 0xfu << US_MR_USART_MODE_Pos ) /**< \brief (US_MR) USART Mode of Operation */
#define US_MR_USART_MODE( value )    ( ( US_MR_USART_MODE_Msk & ( ( value ) << US_MR_USART_MODE_Pos ) ) )
#define   US_MR_USART_MODE_NORMAL            ( 0x0u << 0 )                    /**< \brief (US_MR) Normal mode */
#define   US_MR_USART_MODE_RS485             ( 0x1u << 0 )                    /**< \brief (US_MR) RS485 */
#define   US_MR_USART_MODE_HW_HANDSHAKING    ( 0x2u << 0 )                    /**< \brief (US_MR) Hardware Handshaking */
#define   US_MR_USART_MODE_IS07816_T_0       ( 0x4u << 0 )                    /**< \brief (US_MR) IS07816 Protocol: T = 0 */
#define   US_MR_USART_MODE_IS07816_T_1       ( 0x6u << 0 )                    /**< \brief (US_MR) IS07816 Protocol: T = 1 */
#define   US_MR_USART_MODE_LON               ( 0x9u << 0 )                    /**< \brief (US_MR) LON */
#define   US_MR_USART_MODE_SPI_MASTER        ( 0xEu << 0 )                    /**< \brief (US_MR) SPI master */
#define   US_MR_USART_MODE_SPI_SLAVE         ( 0xFu << 0 )                    /**< \brief (US_MR) SPI Slave */
#define US_MR_USCLKS_Pos                     4
#define US_MR_USCLKS_Msk                     ( 0x3u << US_MR_USCLKS_Pos )     /**< \brief (US_MR) Clock Selection */
#define US_MR_USCLKS( value )    ( ( US_MR_USCLKS_Msk & ( ( value ) << US_MR_USCLKS_Pos ) ) )
#define   US_MR_USCLKS_MCK                   ( 0x0u << 4 )                    /**< \brief (US_MR) Peripheral clock is selected */
#define   US_MR_USCLKS_DIV                   ( 0x1u << 4 )                    /**< \brief (US_MR) Peripheral clock divided (DIV=DIV=8) is selected */
#define   US_MR_USCLKS_PCK                   ( 0x2u << 4 )                    /**< \brief (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1. */
#define   US_MR_USCLKS_SCK                   ( 0x3u << 4 )                    /**< \brief (US_MR) Serial clock (SCK) is selected */
#define US_MR_CHRL_Pos                       6
#define US_MR_CHRL_Msk                       ( 0x3u << US_MR_CHRL_Pos )       /**< \brief (US_MR) Character Length */
#define US_MR_CHRL( value )    ( ( US_MR_CHRL_Msk & ( ( value ) << US_MR_CHRL_Pos ) ) )
#define   US_MR_CHRL_5_BIT                   ( 0x0u << 6 )                    /**< \brief (US_MR) Character length is 5 bits */
#define   US_MR_CHRL_6_BIT                   ( 0x1u << 6 )                    /**< \brief (US_MR) Character length is 6 bits */
#define   US_MR_CHRL_7_BIT                   ( 0x2u << 6 )                    /**< \brief (US_MR) Character length is 7 bits */
#define   US_MR_CHRL_8_BIT                   ( 0x3u << 6 )                    /**< \brief (US_MR) Character length is 8 bits */
#define US_MR_SYNC                           ( 0x1u << 8 )                    /**< \brief (US_MR) Synchronous Mode Select */
#define US_MR_PAR_Pos                        9
#define US_MR_PAR_Msk                        ( 0x7u << US_MR_PAR_Pos )        /**< \brief (US_MR) Parity Type */
#define US_MR_PAR( value )    ( ( US_MR_PAR_Msk & ( ( value ) << US_MR_PAR_Pos ) ) )
#define   US_MR_PAR_EVEN                     ( 0x0u << 9 )                    /**< \brief (US_MR) Even parity */
#define   US_MR_PAR_ODD                      ( 0x1u << 9 )                    /**< \brief (US_MR) Odd parity */
#define   US_MR_PAR_SPACE                    ( 0x2u << 9 )                    /**< \brief (US_MR) Parity forced to 0 (Space) */
#define   US_MR_PAR_MARK                     ( 0x3u << 9 )                    /**< \brief (US_MR) Parity forced to 1 (Mark) */
#define   US_MR_PAR_NO                       ( 0x4u << 9 )                    /**< \brief (US_MR) No parity */
#define   US_MR_PAR_MULTIDROP                ( 0x6u << 9 )                    /**< \brief (US_MR) Multidrop mode */
#define US_MR_NBSTOP_Pos                     12
#define US_MR_NBSTOP_Msk                     ( 0x3u << US_MR_NBSTOP_Pos )     /**< \brief (US_MR) Number of Stop Bits */
#define US_MR_NBSTOP( value )    ( ( US_MR_NBSTOP_Msk & ( ( value ) << US_MR_NBSTOP_Pos ) ) )
#define   US_MR_NBSTOP_1_BIT                 ( 0x0u << 12 )                   /**< \brief (US_MR) 1 stop bit */
#define   US_MR_NBSTOP_1_5_BIT               ( 0x1u << 12 )                   /**< \brief (US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1) */
#define   US_MR_NBSTOP_2_BIT                 ( 0x2u << 12 )                   /**< \brief (US_MR) 2 stop bits */
#define US_MR_CHMODE_Pos                     14
#define US_MR_CHMODE_Msk                     ( 0x3u << US_MR_CHMODE_Pos )     /**< \brief (US_MR) Channel Mode */
#define US_MR_CHMODE( value )    ( ( US_MR_CHMODE_Msk & ( ( value ) << US_MR_CHMODE_Pos ) ) )
#define   US_MR_CHMODE_NORMAL                ( 0x0u << 14 )                   /**< \brief (US_MR) Normal mode */
#define   US_MR_CHMODE_AUTOMATIC             ( 0x1u << 14 )                   /**< \brief (US_MR) Automatic Echo. Receiver input is connected to the TXD pin. */
#define   US_MR_CHMODE_LOCAL_LOOPBACK        ( 0x2u << 14 )                   /**< \brief (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. */
#define   US_MR_CHMODE_REMOTE_LOOPBACK       ( 0x3u << 14 )                   /**< \brief (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. */
#define US_MR_MODE9                          ( 0x1u << 17 )                   /**< \brief (US_MR) 9-bit Character Length */
#define US_MR_CLKO                           ( 0x1u << 18 )                   /**< \brief (US_MR) Clock Output Select */
#define US_MR_OVER                           ( 0x1u << 19 )                   /**< \brief (US_MR) Oversampling Mode */
#define US_MR_VAR_SYNC                       ( 0x1u << 22 )                   /**< \brief (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter */
#define US_MR_FILTER                         ( 0x1u << 28 )                   /**< \brief (US_MR) Receive Line Filter */
#define US_MR_MAN                            ( 0x1u << 29 )                   /**< \brief (US_MR) Manchester Encoder/Decoder Enable */
#define US_MR_MODSYNC                        ( 0x1u << 30 )                   /**< \brief (US_MR) Manchester Synchronization Mode */
#define US_MR_ONEBIT                         ( 0x1u << 31 )                   /**< \brief (US_MR) Start Frame Delimiter Selector */
#define US_MR_CPHA                           ( 0x1u << 8 )                    /**< \brief (US_MR) SPI Clock Phase */
#define US_MR_CPOL                           ( 0x1u << 16 )                   /**< \brief (US_MR) SPI Clock Polarity */
#define US_MR_WRDBT                          ( 0x1u << 20 )                   /**< \brief (US_MR) Wait Read Data Before Transfer */
/* -------- US_IER : (USART Offset: 0x0008) Interrupt Enable Register -------- */
#define US_IER_RXRDY                         ( 0x1u << 0 )                    /**< \brief (US_IER) RXRDY Interrupt Enable */
#define US_IER_TXRDY                         ( 0x1u << 1 )                    /**< \brief (US_IER) TXRDY Interrupt Enable */
#define US_IER_RXBRK                         ( 0x1u << 2 )                    /**< \brief (US_IER) Receiver Break Interrupt Enable */
#define US_IER_OVRE                          ( 0x1u << 5 )                    /**< \brief (US_IER) Overrun Error Interrupt Enable */
#define US_IER_FRAME                         ( 0x1u << 6 )                    /**< \brief (US_IER) Framing Error Interrupt Enable */
#define US_IER_PARE                          ( 0x1u << 7 )                    /**< \brief (US_IER) Parity Error Interrupt Enable */
#define US_IER_TIMEOUT                       ( 0x1u << 8 )                    /**< \brief (US_IER) Time-out Interrupt Enable */
#define US_IER_TXEMPTY                       ( 0x1u << 9 )                    /**< \brief (US_IER) TXEMPTY Interrupt Enable */
#define US_IER_CTSIC                         ( 0x1u << 19 )                   /**< \brief (US_IER) Clear to Send Input Change Interrupt Enable */
#define US_IER_MANE                          ( 0x1u << 24 )                   /**< \brief (US_IER) Manchester Error Interrupt Enable */
#define US_IER_UNRE                          ( 0x1u << 10 )                   /**< \brief (US_IER) SPI Underrun Error Interrupt Enable */
#define US_IER_LINBK                         ( 0x1u << 13 )                   /**< \brief (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable */
#define US_IER_LINID                         ( 0x1u << 14 )                   /**< \brief (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable */
#define US_IER_LINTC                         ( 0x1u << 15 )                   /**< \brief (US_IER) LIN Transfer Completed Interrupt Enable */
#define US_IER_LINBE                         ( 0x1u << 25 )                   /**< \brief (US_IER) LIN Bus Error Interrupt Enable */
#define US_IER_LINISFE                       ( 0x1u << 26 )                   /**< \brief (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable */
#define US_IER_LINIPE                        ( 0x1u << 27 )                   /**< \brief (US_IER) LIN Identifier Parity Interrupt Enable */
#define US_IER_LINCE                         ( 0x1u << 28 )                   /**< \brief (US_IER) LIN Checksum Error Interrupt Enable */
#define US_IER_LINSNRE                       ( 0x1u << 29 )                   /**< \brief (US_IER) LIN Slave Not Responding Error Interrupt Enable */
#define US_IER_LINSTE                        ( 0x1u << 30 )                   /**< \brief (US_IER) LIN Synch Tolerance Error Interrupt Enable */
#define US_IER_LINHTE                        ( 0x1u << 31 )                   /**< \brief (US_IER) LIN Header Timeout Error Interrupt Enable */
#define US_IER_LSFE                          ( 0x1u << 6 )                    /**< \brief (US_IER) LON Short Frame Error Interrupt Enable */
#define US_IER_LCRCE                         ( 0x1u << 7 )                    /**< \brief (US_IER) LON CRC Error Interrupt Enable */
#define US_IER_LTXD                          ( 0x1u << 24 )                   /**< \brief (US_IER) LON Transmission Done Interrupt Enable */
#define US_IER_LCOL                          ( 0x1u << 25 )                   /**< \brief (US_IER) LON Collision Interrupt Enable */
#define US_IER_LFET                          ( 0x1u << 26 )                   /**< \brief (US_IER) LON Frame Early Termination Interrupt Enable */
#define US_IER_LRXD                          ( 0x1u << 27 )                   /**< \brief (US_IER) LON Reception Done Interrupt Enable */
#define US_IER_LBLOVFE                       ( 0x1u << 28 )                   /**< \brief (US_IER) LON Backlog Overflow Error Interrupt Enable */
/* -------- US_IDR : (USART Offset: 0x000C) Interrupt Disable Register -------- */
#define US_IDR_RXRDY                         ( 0x1u << 0 )                    /**< \brief (US_IDR) RXRDY Interrupt Disable */
#define US_IDR_TXRDY                         ( 0x1u << 1 )                    /**< \brief (US_IDR) TXRDY Interrupt Disable */
#define US_IDR_RXBRK                         ( 0x1u << 2 )                    /**< \brief (US_IDR) Receiver Break Interrupt Disable */
#define US_IDR_OVRE                          ( 0x1u << 5 )                    /**< \brief (US_IDR) Overrun Error Interrupt Enable */
#define US_IDR_FRAME                         ( 0x1u << 6 )                    /**< \brief (US_IDR) Framing Error Interrupt Disable */
#define US_IDR_PARE                          ( 0x1u << 7 )                    /**< \brief (US_IDR) Parity Error Interrupt Disable */
#define US_IDR_TIMEOUT                       ( 0x1u << 8 )                    /**< \brief (US_IDR) Time-out Interrupt Disable */
#define US_IDR_TXEMPTY                       ( 0x1u << 9 )                    /**< \brief (US_IDR) TXEMPTY Interrupt Disable */
#define US_IDR_CTSIC                         ( 0x1u << 19 )                   /**< \brief (US_IDR) Clear to Send Input Change Interrupt Disable */
#define US_IDR_MANE                          ( 0x1u << 24 )                   /**< \brief (US_IDR) Manchester Error Interrupt Disable */
#define US_IDR_UNRE                          ( 0x1u << 10 )                   /**< \brief (US_IDR) SPI Underrun Error Interrupt Disable */
#define US_IDR_LINBK                         ( 0x1u << 13 )                   /**< \brief (US_IDR) LIN Break Sent or LIN Break Received Interrupt Disable */
#define US_IDR_LINID                         ( 0x1u << 14 )                   /**< \brief (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable */
#define US_IDR_LINTC                         ( 0x1u << 15 )                   /**< \brief (US_IDR) LIN Transfer Completed Interrupt Disable */
#define US_IDR_LINBE                         ( 0x1u << 25 )                   /**< \brief (US_IDR) LIN Bus Error Interrupt Disable */
#define US_IDR_LINISFE                       ( 0x1u << 26 )                   /**< \brief (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable */
#define US_IDR_LINIPE                        ( 0x1u << 27 )                   /**< \brief (US_IDR) LIN Identifier Parity Interrupt Disable */
#define US_IDR_LINCE                         ( 0x1u << 28 )                   /**< \brief (US_IDR) LIN Checksum Error Interrupt Disable */
#define US_IDR_LINSNRE                       ( 0x1u << 29 )                   /**< \brief (US_IDR) LIN Slave Not Responding Error Interrupt Disable */
#define US_IDR_LINSTE                        ( 0x1u << 30 )                   /**< \brief (US_IDR) LIN Synch Tolerance Error Interrupt Disable */
#define US_IDR_LINHTE                        ( 0x1u << 31 )                   /**< \brief (US_IDR) LIN Header Timeout Error Interrupt Disable */
#define US_IDR_LSFE                          ( 0x1u << 6 )                    /**< \brief (US_IDR) LON Short Frame Error Interrupt Disable */
#define US_IDR_LCRCE                         ( 0x1u << 7 )                    /**< \brief (US_IDR) LON CRC Error Interrupt Disable */
#define US_IDR_LTXD                          ( 0x1u << 24 )                   /**< \brief (US_IDR) LON Transmission Done Interrupt Disable */
#define US_IDR_LCOL                          ( 0x1u << 25 )                   /**< \brief (US_IDR) LON Collision Interrupt Disable */
#define US_IDR_LFET                          ( 0x1u << 26 )                   /**< \brief (US_IDR) LON Frame Early Termination Interrupt Disable */
#define US_IDR_LRXD                          ( 0x1u << 27 )                   /**< \brief (US_IDR) LON Reception Done Interrupt Disable */
#define US_IDR_LBLOVFE                       ( 0x1u << 28 )                   /**< \brief (US_IDR) LON Backlog Overflow Error Interrupt Disable */
/* -------- US_IMR : (USART Offset: 0x0010) Interrupt Mask Register -------- */
#define US_IMR_RXRDY                         ( 0x1u << 0 )                    /**< \brief (US_IMR) RXRDY Interrupt Mask */
#define US_IMR_TXRDY                         ( 0x1u << 1 )                    /**< \brief (US_IMR) TXRDY Interrupt Mask */
#define US_IMR_RXBRK                         ( 0x1u << 2 )                    /**< \brief (US_IMR) Receiver Break Interrupt Mask */
#define US_IMR_OVRE                          ( 0x1u << 5 )                    /**< \brief (US_IMR) Overrun Error Interrupt Mask */
#define US_IMR_FRAME                         ( 0x1u << 6 )                    /**< \brief (US_IMR) Framing Error Interrupt Mask */
#define US_IMR_PARE                          ( 0x1u << 7 )                    /**< \brief (US_IMR) Parity Error Interrupt Mask */
