FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_usart.h
#define US_IMR_TIMEOUT                       ( 0x1u << 8 )                    /**< \brief (US_IMR) Time-out Interrupt Mask */
#define US_IMR_TXEMPTY                       ( 0x1u << 9 )                    /**< \brief (US_IMR) TXEMPTY Interrupt Mask */
#define US_IMR_CTSIC                         ( 0x1u << 19 )                   /**< \brief (US_IMR) Clear to Send Input Change Interrupt Mask */
#define US_IMR_MANE                          ( 0x1u << 24 )                   /**< \brief (US_IMR) Manchester Error Interrupt Mask */
#define US_IMR_UNRE                          ( 0x1u << 10 )                   /**< \brief (US_IMR) SPI Underrun Error Interrupt Mask */
#define US_IMR_LINBK                         ( 0x1u << 13 )                   /**< \brief (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask */
#define US_IMR_LINID                         ( 0x1u << 14 )                   /**< \brief (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask */
#define US_IMR_LINTC                         ( 0x1u << 15 )                   /**< \brief (US_IMR) LIN Transfer Completed Interrupt Mask */
#define US_IMR_LINBE                         ( 0x1u << 25 )                   /**< \brief (US_IMR) LIN Bus Error Interrupt Mask */
#define US_IMR_LINISFE                       ( 0x1u << 26 )                   /**< \brief (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask */
#define US_IMR_LINIPE                        ( 0x1u << 27 )                   /**< \brief (US_IMR) LIN Identifier Parity Interrupt Mask */
#define US_IMR_LINCE                         ( 0x1u << 28 )                   /**< \brief (US_IMR) LIN Checksum Error Interrupt Mask */
#define US_IMR_LINSNRE                       ( 0x1u << 29 )                   /**< \brief (US_IMR) LIN Slave Not Responding Error Interrupt Mask */
#define US_IMR_LINSTE                        ( 0x1u << 30 )                   /**< \brief (US_IMR) LIN Synch Tolerance Error Interrupt Mask */
#define US_IMR_LINHTE                        ( 0x1u << 31 )                   /**< \brief (US_IMR) LIN Header Timeout Error Interrupt Mask */
#define US_IMR_LSFE                          ( 0x1u << 6 )                    /**< \brief (US_IMR) LON Short Frame Error Interrupt Mask */
#define US_IMR_LCRCE                         ( 0x1u << 7 )                    /**< \brief (US_IMR) LON CRC Error Interrupt Mask */
#define US_IMR_LTXD                          ( 0x1u << 24 )                   /**< \brief (US_IMR) LON Transmission Done Interrupt Mask */
#define US_IMR_LCOL                          ( 0x1u << 25 )                   /**< \brief (US_IMR) LON Collision Interrupt Mask */
#define US_IMR_LFET                          ( 0x1u << 26 )                   /**< \brief (US_IMR) LON Frame Early Termination Interrupt Mask */
#define US_IMR_LRXD                          ( 0x1u << 27 )                   /**< \brief (US_IMR) LON Reception Done Interrupt Mask */
#define US_IMR_LBLOVFE                       ( 0x1u << 28 )                   /**< \brief (US_IMR) LON Backlog Overflow Error Interrupt Mask */
/* -------- US_CSR : (USART Offset: 0x0014) Channel Status Register -------- */
#define US_CSR_RXRDY                         ( 0x1u << 0 )                    /**< \brief (US_CSR) Receiver Ready (cleared by reading US_RHR) */
#define US_CSR_TXRDY                         ( 0x1u << 1 )                    /**< \brief (US_CSR) Transmitter Ready (cleared by writing US_THR) */
#define US_CSR_RXBRK                         ( 0x1u << 2 )                    /**< \brief (US_CSR) Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_OVRE                          ( 0x1u << 5 )                    /**< \brief (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_FRAME                         ( 0x1u << 6 )                    /**< \brief (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_PARE                          ( 0x1u << 7 )                    /**< \brief (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_TIMEOUT                       ( 0x1u << 8 )                    /**< \brief (US_CSR) Receiver Time-out (cleared by writing a one to bit US_CR.STTTO) */
#define US_CSR_TXEMPTY                       ( 0x1u << 9 )                    /**< \brief (US_CSR) Transmitter Empty (cleared by writing US_THR) */
#define US_CSR_NACK                          ( 0x1u << 13 )                   /**< \brief (US_CSR) Non AcknowledgeInterrupt */
#define US_CSR_CTSIC                         ( 0x1u << 19 )                   /**< \brief (US_CSR) Clear to Send Input Change Flag (cleared on read) */
#define US_CSR_CTS                           ( 0x1u << 23 )                   /**< \brief (US_CSR) Image of CTS Input */
#define US_CSR_MANERR                        ( 0x1u << 24 )                   /**< \brief (US_CSR) Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) */
#define US_CSR_UNRE                          ( 0x1u << 10 )                   /**< \brief (US_CSR) Underrun Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINBK                         ( 0x1u << 13 )                   /**< \brief (US_CSR) LIN Break Sent or LIN Break Received (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINID                         ( 0x1u << 14 )                   /**< \brief (US_CSR) LIN Identifier Sent or LIN Identifier Received (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINTC                         ( 0x1u << 15 )                   /**< \brief (US_CSR) LIN Transfer Completed (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINBLS                        ( 0x1u << 23 )                   /**< \brief (US_CSR) LIN Bus Line Status */
#define US_CSR_LINBE                         ( 0x1u << 25 )                   /**< \brief (US_CSR) LIN Bit Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINISFE                       ( 0x1u << 26 )                   /**< \brief (US_CSR) LIN Inconsistent Synch Field Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINIPE                        ( 0x1u << 27 )                   /**< \brief (US_CSR) LIN Identifier Parity Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINCE                         ( 0x1u << 28 )                   /**< \brief (US_CSR) LIN Checksum Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINSNRE                       ( 0x1u << 29 )                   /**< \brief (US_CSR) LIN Slave Not Responding Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINSTE                        ( 0x1u << 30 )                   /**< \brief (US_CSR) LIN Synch Tolerance Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LINHTE                        ( 0x1u << 31 )                   /**< \brief (US_CSR) LIN Header Timeout Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LSFE                          ( 0x1u << 6 )                    /**< \brief (US_CSR) LON Short Frame Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LCRCE                         ( 0x1u << 7 )                    /**< \brief (US_CSR) LON CRC Error (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LTXD                          ( 0x1u << 24 )                   /**< \brief (US_CSR) LON Transmission End Flag (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LCOL                          ( 0x1u << 25 )                   /**< \brief (US_CSR) LON Collision Detected Flag (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LFET                          ( 0x1u << 26 )                   /**< \brief (US_CSR) LON Frame Early Termination (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LRXD                          ( 0x1u << 27 )                   /**< \brief (US_CSR) LON Reception End Flag (cleared by writing a one to bit US_CR.RSTSTA) */
#define US_CSR_LBLOVFE                       ( 0x1u << 28 )                   /**< \brief (US_CSR) LON Backlog Overflow Error (cleared by writing a one to bit US_CR.RSTSTA) */
/* -------- US_RHR : (USART Offset: 0x0018) Receive Holding Register -------- */
#define US_RHR_RXCHR_Pos                     0
#define US_RHR_RXCHR_Msk                     ( 0x1ffu << US_RHR_RXCHR_Pos ) /**< \brief (US_RHR) Received Character */
#define US_RHR_RXSYNH                        ( 0x1u << 15 )                 /**< \brief (US_RHR) Received Sync */
/* -------- US_THR : (USART Offset: 0x001C) Transmit Holding Register -------- */
#define US_THR_TXCHR_Pos                     0
#define US_THR_TXCHR_Msk                     ( 0x1ffu << US_THR_TXCHR_Pos ) /**< \brief (US_THR) Character to be Transmitted */
#define US_THR_TXCHR( value )    ( ( US_THR_TXCHR_Msk & ( ( value ) << US_THR_TXCHR_Pos ) ) )
#define US_THR_TXSYNH                        ( 0x1u << 15 )                 /**< \brief (US_THR) Sync Field to be Transmitted */
/* -------- US_BRGR : (USART Offset: 0x0020) Baud Rate Generator Register -------- */
#define US_BRGR_CD_Pos                       0
#define US_BRGR_CD_Msk                       ( 0xffffu << US_BRGR_CD_Pos ) /**< \brief (US_BRGR) Clock Divider */
#define US_BRGR_CD( value )    ( ( US_BRGR_CD_Msk & ( ( value ) << US_BRGR_CD_Pos ) ) )
#define US_BRGR_FP_Pos                       16
#define US_BRGR_FP_Msk                       ( 0x7u << US_BRGR_FP_Pos ) /**< \brief (US_BRGR) Fractional Part */
#define US_BRGR_FP( value )    ( ( US_BRGR_FP_Msk & ( ( value ) << US_BRGR_FP_Pos ) ) )
/* -------- US_RTOR : (USART Offset: 0x0024) Receiver Time-out Register -------- */
#define US_RTOR_TO_Pos                       0
#define US_RTOR_TO_Msk                       ( 0x1ffffu << US_RTOR_TO_Pos ) /**< \brief (US_RTOR) Time-out Value */
#define US_RTOR_TO( value )    ( ( US_RTOR_TO_Msk & ( ( value ) << US_RTOR_TO_Pos ) ) )
/* -------- US_TTGR : (USART Offset: 0x0028) Transmitter Timeguard Register -------- */
#define US_TTGR_TG_Pos                       0
#define US_TTGR_TG_Msk                       ( 0xffu << US_TTGR_TG_Pos ) /**< \brief (US_TTGR) Timeguard Value */
#define US_TTGR_TG( value )        ( ( US_TTGR_TG_Msk & ( ( value ) << US_TTGR_TG_Pos ) ) )
#define US_TTGR_PCYCLE_Pos                   0
#define US_TTGR_PCYCLE_Msk                   ( 0xffffffu << US_TTGR_PCYCLE_Pos ) /**< \brief (US_TTGR) LON PCYCLE Length */
#define US_TTGR_PCYCLE( value )    ( ( US_TTGR_PCYCLE_Msk & ( ( value ) << US_TTGR_PCYCLE_Pos ) ) )
/* -------- US_MAN : (USART Offset: 0x0050) Manchester Configuration Register -------- */
#define US_MAN_TX_PL_Pos                     0
#define US_MAN_TX_PL_Msk                     ( 0xfu << US_MAN_TX_PL_Pos ) /**< \brief (US_MAN) Transmitter Preamble Length */
#define US_MAN_TX_PL( value )    ( ( US_MAN_TX_PL_Msk & ( ( value ) << US_MAN_TX_PL_Pos ) ) )
#define US_MAN_TX_PP_Pos                     8
#define US_MAN_TX_PP_Msk                     ( 0x3u << US_MAN_TX_PP_Pos ) /**< \brief (US_MAN) Transmitter Preamble Pattern */
#define US_MAN_TX_PP( value )    ( ( US_MAN_TX_PP_Msk & ( ( value ) << US_MAN_TX_PP_Pos ) ) )
#define   US_MAN_TX_PP_ALL_ONE               ( 0x0u << 8 )                /**< \brief (US_MAN) The preamble is composed of '1's */
#define   US_MAN_TX_PP_ALL_ZERO              ( 0x1u << 8 )                /**< \brief (US_MAN) The preamble is composed of '0's */
#define   US_MAN_TX_PP_ZERO_ONE              ( 0x2u << 8 )                /**< \brief (US_MAN) The preamble is composed of '01's */
#define   US_MAN_TX_PP_ONE_ZERO              ( 0x3u << 8 )                /**< \brief (US_MAN) The preamble is composed of '10's */
#define US_MAN_TX_MPOL                       ( 0x1u << 12 )               /**< \brief (US_MAN) Transmitter Manchester Polarity */
#define US_MAN_RX_PL_Pos                     16
#define US_MAN_RX_PL_Msk                     ( 0xfu << US_MAN_RX_PL_Pos ) /**< \brief (US_MAN) Receiver Preamble Length */
#define US_MAN_RX_PL( value )    ( ( US_MAN_RX_PL_Msk & ( ( value ) << US_MAN_RX_PL_Pos ) ) )
#define US_MAN_RX_PP_Pos                     24
#define US_MAN_RX_PP_Msk                     ( 0x3u << US_MAN_RX_PP_Pos ) /**< \brief (US_MAN) Receiver Preamble Pattern detected */
#define US_MAN_RX_PP( value )    ( ( US_MAN_RX_PP_Msk & ( ( value ) << US_MAN_RX_PP_Pos ) ) )
#define   US_MAN_RX_PP_ALL_ONE               ( 0x0u << 24 )               /**< \brief (US_MAN) The preamble is composed of '1's */
#define   US_MAN_RX_PP_ALL_ZERO              ( 0x1u << 24 )               /**< \brief (US_MAN) The preamble is composed of '0's */
#define   US_MAN_RX_PP_ZERO_ONE              ( 0x2u << 24 )               /**< \brief (US_MAN) The preamble is composed of '01's */
#define   US_MAN_RX_PP_ONE_ZERO              ( 0x3u << 24 )               /**< \brief (US_MAN) The preamble is composed of '10's */
#define US_MAN_RX_MPOL                       ( 0x1u << 28 )               /**< \brief (US_MAN) Receiver Manchester Polarity */
#define US_MAN_ONE                           ( 0x1u << 29 )               /**< \brief (US_MAN) Must Be Set to 1 */
#define US_MAN_DRIFT                         ( 0x1u << 30 )               /**< \brief (US_MAN) Drift Compensation */
#define US_MAN_RXIDLEV                       ( 0x1u << 31 )               /**< \brief (US_MAN)  */
/* -------- US_LINMR : (USART Offset: 0x0054) LIN Mode Register -------- */
#define US_LINMR_NACT_Pos                    0
#define US_LINMR_NACT_Msk                    ( 0x3u << US_LINMR_NACT_Pos ) /**< \brief (US_LINMR) LIN Node Action */
#define US_LINMR_NACT( value )    ( ( US_LINMR_NACT_Msk & ( ( value ) << US_LINMR_NACT_Pos ) ) )
#define   US_LINMR_NACT_PUBLISH              ( 0x0u << 0 )                 /**< \brief (US_LINMR) The USART transmits the response. */
#define   US_LINMR_NACT_SUBSCRIBE            ( 0x1u << 0 )                 /**< \brief (US_LINMR) The USART receives the response. */
#define   US_LINMR_NACT_IGNORE               ( 0x2u << 0 )                 /**< \brief (US_LINMR) The USART does not transmit and does not receive the response. */
#define US_LINMR_PARDIS                      ( 0x1u << 2 )                 /**< \brief (US_LINMR) Parity Disable */
#define US_LINMR_CHKDIS                      ( 0x1u << 3 )                 /**< \brief (US_LINMR) Checksum Disable */
#define US_LINMR_CHKTYP                      ( 0x1u << 4 )                 /**< \brief (US_LINMR) Checksum Type */
#define US_LINMR_DLM                         ( 0x1u << 5 )                 /**< \brief (US_LINMR) Data Length Mode */
#define US_LINMR_FSDIS                       ( 0x1u << 6 )                 /**< \brief (US_LINMR) Frame Slot Mode Disable */
#define US_LINMR_WKUPTYP                     ( 0x1u << 7 )                 /**< \brief (US_LINMR) Wakeup Signal Type */
#define US_LINMR_DLC_Pos                     8
#define US_LINMR_DLC_Msk                     ( 0xffu << US_LINMR_DLC_Pos ) /**< \brief (US_LINMR) Data Length Control */
#define US_LINMR_DLC( value )    ( ( US_LINMR_DLC_Msk & ( ( value ) << US_LINMR_DLC_Pos ) ) )
#define US_LINMR_PDCM                        ( 0x1u << 16 )                /**< \brief (US_LINMR) DMAC Mode */
#define US_LINMR_SYNCDIS                     ( 0x1u << 17 )                /**< \brief (US_LINMR) Synchronization Disable */
/* -------- US_LINIR : (USART Offset: 0x0058) LIN Identifier Register -------- */
#define US_LINIR_IDCHR_Pos                   0
#define US_LINIR_IDCHR_Msk                   ( 0xffu << US_LINIR_IDCHR_Pos ) /**< \brief (US_LINIR) Identifier Character */
#define US_LINIR_IDCHR( value )    ( ( US_LINIR_IDCHR_Msk & ( ( value ) << US_LINIR_IDCHR_Pos ) ) )
/* -------- US_LINBRR : (USART Offset: 0x005C) LIN Baud Rate Register -------- */
#define US_LINBRR_LINCD_Pos                  0
#define US_LINBRR_LINCD_Msk                  ( 0xffffu << US_LINBRR_LINCD_Pos ) /**< \brief (US_LINBRR) Clock Divider after Synchronization */
#define US_LINBRR_LINFP_Pos                  16
#define US_LINBRR_LINFP_Msk                  ( 0x7u << US_LINBRR_LINFP_Pos )    /**< \brief (US_LINBRR) Fractional Part after Synchronization */
/* -------- US_LONMR : (USART Offset: 0x0060) LON Mode Register -------- */
#define US_LONMR_COMMT                       ( 0x1u << 0 )                      /**< \brief (US_LONMR) LON comm_type Parameter Value */
#define US_LONMR_COLDET                      ( 0x1u << 1 )                      /**< \brief (US_LONMR) LON Collision Detection Feature */
#define US_LONMR_TCOL                        ( 0x1u << 2 )                      /**< \brief (US_LONMR) Terminate Frame upon Collision Notification */
#define US_LONMR_CDTAIL                      ( 0x1u << 3 )                      /**< \brief (US_LONMR) LON Collision Detection on Frame Tail */
#define US_LONMR_DMAM                        ( 0x1u << 4 )                      /**< \brief (US_LONMR) LON DMA Mode */
#define US_LONMR_LCDS                        ( 0x1u << 5 )                      /**< \brief (US_LONMR) LON Collision Detection Source */
#define US_LONMR_EOFS_Pos                    16
#define US_LONMR_EOFS_Msk                    ( 0xffu << US_LONMR_EOFS_Pos )     /**< \brief (US_LONMR) End of Frame Condition Size */
#define US_LONMR_EOFS( value )    ( ( US_LONMR_EOFS_Msk & ( ( value ) << US_LONMR_EOFS_Pos ) ) )
/* -------- US_LONPR : (USART Offset: 0x0064) LON Preamble Register -------- */
#define US_LONPR_LONPL_Pos                   0
#define US_LONPR_LONPL_Msk                   ( 0x3fffu << US_LONPR_LONPL_Pos ) /**< \brief (US_LONPR) LON Preamble Length */
#define US_LONPR_LONPL( value )    ( ( US_LONPR_LONPL_Msk & ( ( value ) << US_LONPR_LONPL_Pos ) ) )
/* -------- US_LONDL : (USART Offset: 0x0068) LON Data Length Register -------- */
#define US_LONDL_LONDL_Pos                   0
#define US_LONDL_LONDL_Msk                   ( 0xffu << US_LONDL_LONDL_Pos ) /**< \brief (US_LONDL) LON Data Length */
#define US_LONDL_LONDL( value )    ( ( US_LONDL_LONDL_Msk & ( ( value ) << US_LONDL_LONDL_Pos ) ) )
/* -------- US_LONL2HDR : (USART Offset: 0x006C) LON L2HDR Register -------- */
#define US_LONL2HDR_BLI_Pos                  0
#define US_LONL2HDR_BLI_Msk                  ( 0x3fu << US_LONL2HDR_BLI_Pos ) /**< \brief (US_LONL2HDR) LON Backlog Increment */
#define US_LONL2HDR_BLI( value )    ( ( US_LONL2HDR_BLI_Msk & ( ( value ) << US_LONL2HDR_BLI_Pos ) ) )
#define US_LONL2HDR_ALTP                     ( 0x1u << 6 )                    /**< \brief (US_LONL2HDR) LON Alternate Path Bit */
#define US_LONL2HDR_PB                       ( 0x1u << 7 )                    /**< \brief (US_LONL2HDR) LON Priority Bit */
/* -------- US_LONBL : (USART Offset: 0x0070) LON Backlog Register -------- */
#define US_LONBL_LONBL_Pos                   0
#define US_LONBL_LONBL_Msk                   ( 0x3fu << US_LONBL_LONBL_Pos ) /**< \brief (US_LONBL) LON Node Backlog Value */
/* -------- US_LONB1TX : (USART Offset: 0x0074) LON Beta1 Tx Register -------- */
#define US_LONB1TX_BETA1TX_Pos               0
#define US_LONB1TX_BETA1TX_Msk               ( 0xffffffu << US_LONB1TX_BETA1TX_Pos ) /**< \brief (US_LONB1TX) LON Beta1 Length after Transmission */
#define US_LONB1TX_BETA1TX( value )    ( ( US_LONB1TX_BETA1TX_Msk & ( ( value ) << US_LONB1TX_BETA1TX_Pos ) ) )
/* -------- US_LONB1RX : (USART Offset: 0x0078) LON Beta1 Rx Register -------- */
#define US_LONB1RX_BETA1RX_Pos               0
#define US_LONB1RX_BETA1RX_Msk               ( 0xffffffu << US_LONB1RX_BETA1RX_Pos ) /**< \brief (US_LONB1RX) LON Beta1 Length after Reception */
#define US_LONB1RX_BETA1RX( value )    ( ( US_LONB1RX_BETA1RX_Msk & ( ( value ) << US_LONB1RX_BETA1RX_Pos ) ) )
/* -------- US_LONPRIO : (USART Offset: 0x007C) LON Priority Register -------- */
#define US_LONPRIO_PSNB_Pos                  0
#define US_LONPRIO_PSNB_Msk                  ( 0x7fu << US_LONPRIO_PSNB_Pos ) /**< \brief (US_LONPRIO) LON Priority Slot Number */
#define US_LONPRIO_PSNB( value )    ( ( US_LONPRIO_PSNB_Msk & ( ( value ) << US_LONPRIO_PSNB_Pos ) ) )
#define US_LONPRIO_NPS_Pos                   8
#define US_LONPRIO_NPS_Msk                   ( 0x7fu << US_LONPRIO_NPS_Pos ) /**< \brief (US_LONPRIO) LON Node Priority Slot */
#define US_LONPRIO_NPS( value )     ( ( US_LONPRIO_NPS_Msk & ( ( value ) << US_LONPRIO_NPS_Pos ) ) )
/* -------- US_IDTTX : (USART Offset: 0x0080) LON IDT Tx Register -------- */
#define US_IDTTX_IDTTX_Pos                   0
#define US_IDTTX_IDTTX_Msk                   ( 0xffffffu << US_IDTTX_IDTTX_Pos ) /**< \brief (US_IDTTX) LON Indeterminate Time after Transmission (comm_type = 1 mode only) */
#define US_IDTTX_IDTTX( value )    ( ( US_IDTTX_IDTTX_Msk & ( ( value ) << US_IDTTX_IDTTX_Pos ) ) )
/* -------- US_IDTRX : (USART Offset: 0x0084) LON IDT Rx Register -------- */
#define US_IDTRX_IDTRX_Pos                   0
#define US_IDTRX_IDTRX_Msk                   ( 0xffffffu << US_IDTRX_IDTRX_Pos ) /**< \brief (US_IDTRX) LON Indeterminate Time after Reception (comm_type = 1 mode only) */
#define US_IDTRX_IDTRX( value )    ( ( US_IDTRX_IDTRX_Msk & ( ( value ) << US_IDTRX_IDTRX_Pos ) ) )
/* -------- US_ICDIFF : (USART Offset: 0x0088) IC DIFF Register -------- */
#define US_ICDIFF_ICDIFF_Pos                 0
#define US_ICDIFF_ICDIFF_Msk                 ( 0xfu << US_ICDIFF_ICDIFF_Pos ) /**< \brief (US_ICDIFF) IC Differentiator Number */
#define US_ICDIFF_ICDIFF( value )    ( ( US_ICDIFF_ICDIFF_Msk & ( ( value ) << US_ICDIFF_ICDIFF_Pos ) ) )
/* -------- US_WPMR : (USART Offset: 0x00E4) Write Protection Mode Register -------- */
#define US_WPMR_WPEN                         ( 0x1u << 0 )                      /**< \brief (US_WPMR) Write Protection Enable */
#define US_WPMR_WPKEY_Pos                    8
#define US_WPMR_WPKEY_Msk                    ( 0xffffffu << US_WPMR_WPKEY_Pos ) /**< \brief (US_WPMR) Write Protection Key */
#define US_WPMR_WPKEY( value )    ( ( US_WPMR_WPKEY_Msk & ( ( value ) << US_WPMR_WPKEY_Pos ) ) )
#define   US_WPMR_WPKEY_PASSWD               ( 0x555341u << 8 )                 /**< \brief (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. */
/* -------- US_WPSR : (USART Offset: 0x00E8) Write Protection Status Register -------- */
#define US_WPSR_WPVS                         ( 0x1u << 0 )                      /**< \brief (US_WPSR) Write Protection Violation Status */
#define US_WPSR_WPVSRC_Pos                   8
#define US_WPSR_WPVSRC_Msk                   ( 0xffffu << US_WPSR_WPVSRC_Pos )  /**< \brief (US_WPSR) Write Protection Violation Source */

/*@}*/


#endif /* _SAMV71_USART_COMPONENT_ */
